In [1]:
import pandas as pd

In [2]:
from pandas import Series,DataFrame

In [3]:
obj = Series([4,7,-1,3])

In [4]:
obj

0    4
1    7
2   -1
3    3
dtype: int64

In [5]:
obj.values #checking values of the Serie

array([ 4,  7, -1,  3], dtype=int64)

In [6]:
obj.index #checking indexes

RangeIndex(start=0, stop=4, step=1)

In [11]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c']) #setting indexes by ourselvs

In [12]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2['a']

-5

In [14]:
obj2['d'] = 6

In [15]:
obj2[['a','b','d']]

a   -5
b    7
d    6
dtype: int64

In [18]:
#Mathematical operations don't effect on index-values relationship

In [19]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [20]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [21]:
#Dictionaries can be converted into Series

In [25]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
obj3 = pd.Series(sdata)

In [26]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [27]:
states = ['California','Ohio','Oregon','Texas']
obj4 = pd.Series(sdata,index=states)

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [33]:
#Both the Series object itself and its index have a name attribute

In [34]:
obj4.name = 'population'

In [35]:
obj4.index.name = 'state'

In [36]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [37]:
obj

0    4
1    7
2   -1
3    3
dtype: int64

In [38]:
obj.index = ['Bob','Steve','Jeff','Ryan']

In [39]:
obj

Bob      4
Steve    7
Jeff    -1
Ryan     3
dtype: int64

In [40]:
#DataFrame

In [41]:
data = {'state' : ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
       'year' : [2000,2001,2002,2001,2002,2003],
       'pop' : [1.5,1.7,3.6,2.4,2.9,3.2]}

frame = pd.DataFrame(data)

In [42]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [43]:
frame.head() #first 5 rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [44]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [45]:
#If you pass a column that isnâ€™t contained in the dict, it will appear with missing values in the result

frame2 = pd.DataFrame(data,columns=['year','state','pop','debt'],
                      index=['one','two','three','four',
                             'five','six'])

In [46]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [47]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [48]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [52]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [53]:
val = pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2['debt'] = val

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [55]:
frame2['eastern'] = frame2.state == 'Ohio' #adding a new column that don't exsist yet

In [56]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [57]:
del frame2['eastern'] #deleing a column

In [58]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [61]:
pop = {'Nevada' : {2001: 2.4, 2002 : 2.9},
      'Ohio': {2000: 1.5 , 2001 : 1.7 ,2002 : 1.6}}
frame3 = pd.DataFrame(pop)

In [62]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   1.6
2000     NaN   1.5

In [63]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   1.6   1.5

In [64]:
frame3.values

array([[2.4, 1.7],
       [2.9, 1.6],
       [nan, 1.5]])

In [65]:
#Index Objects

In [66]:
obj = pd.Series(range(3), index=['a','b','c'])
index = obj.index

In [67]:
index

Index(['a', 'b', 'c'], dtype='object')

In [69]:
index[1:]

Index(['b', 'c'], dtype='object')

In [70]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   1.6
2000     NaN   1.5

In [71]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [72]:
'Ohio' in frame3.columns

True

In [73]:
2003 in frame3.index

False

In [74]:
obj = pd.Series([1,2,3,4],index=['a','b','c','d']) #Settting indexes
obj

a    1
b    2
c    3
d    4
dtype: int64

In [75]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [77]:
obj2 #Reindexed version

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [79]:
obj['b':'c']

b    2
c    3
dtype: int64

In [80]:
#Arithmetic and Data Alignment

In [85]:
s1 = pd.Series([7.3,-2.5,3.4,1.5], index=['a','c','d','e'])
s2 = pd.Series([-2.1,3.6,-1.5,4,3.1], index=['a','c','e','f','g'])

In [86]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [87]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [88]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [89]:
#Summarizing and Computing Descriptive Statistics

In [93]:
import numpy as np 

df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],
                   [np.nan,np.nan],[0.75,-1.3]],
                  index=['a','b','c','d'],
                  columns=['one','two'])

In [94]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [95]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [96]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [97]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [101]:
df.mean(axis='columns',skipna=False) #Mean without NaN values

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [102]:
df.idxmax() #Max value per index

one    b
two    d
dtype: object

In [103]:
df.idxmin() #Minimum value per index

one    d
two    b
dtype: object

In [104]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [105]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000